BitOps> set a = 1001001001001001001001
BitOps> set b = 1010101010101010101010
BitOps> show a
0000000000000000000000000000000000000000001001001001001001001001
BitOps> show b
0000000000000000000000000000000000000000001010101010101010101010
BitOps> c = a | b
0000000000000000000000000000000000000000001011101011101011101011
BitOps> c = a & b
0000000000000000000000000000000000000000001000001000001000001000
BitOps> d = ~ c
1111111111111111111111111111111111111111110111110111110111110111
BitOps> e = c | d
1111111111111111111111111111111111111111111111111111111111111111
BitOps> e = ~ e
0000000000000000000000000000000000000000000000000000000000000000
BitOps> show a
0000000000000000000000000000000000000000001001001001001001001001
BitOps> 
